#include <stdio.h>
void magic(int(*pa)[6], int** pp) 
{
    **pp += (*pa)[2];   //(*pa)[2]=a[2]=6,  **pp =*p(a[1]=4),  a[1]= 4 + 6 = 10
                        //此时 a = [2, 10, 6, 8, 10, 12]

    *pp = (*pa) + 5;    //*pp=p，(*pa)+5=a + 5，p现在指向a[5]

    **pp -= (*pa)[0];   //**pp=a【5】，  *pa【0】=a【0】=2，  a【5】=12-2=10,  此时a=[2, 10, 6, 8, 10, 10]

    *pp = (*pa) + ((*(*pa + 3) & 1) ? 3 : 1);//*pa + 3=a+3 (指向a【3】），  *(*pa + 3) =8，8 & 1 = 0，假，结果为 1
                                             //操作后：p指向a + 1（即a[1]）

    *(*pp) += *(*pp - 1);  //*pp即p（指向a[1]），*pp - 1是a（指向a[0]），*(*pp)即a[1]，*(*pp - 1)即a[0] = 2，
                           //操作后：a[1] = 10 + 2 = 12，数组变为[2, 12, 6, 8, 10, 10]

    *pp = (*pa) + 2;   //操作后：p指向a+2（a[2]）
}
int main() 
{
    int a[6] = { 2, 4, 6, 8, 10, 12 };
    int* p = a + 1,** pp = &p;
    magic(&a, pp);
    printf("%d %d\n%d %d %d\n%d %d\n",*p,**pp,a[1],a[2],a[3],a[5],p-a);
    //*p：p指向a[2]，值为6
    //**pp：等价于*p，值为6
    //a[1] = 12，a[2] = 6，a[3] = 8，a[5] = 10
    //p-a：指针偏移量为2（p指向a+2）
    return 0;
}
//运行结果如下
//6 6
//12 6 8
//10 2
